kenny1342/MCU/PumpController/ESP8266-WiFi/src/main.cpp
/**
 * This is code on ESP8266 WiFi module on the board, it reads a JSON encoded string from serial and makes it available via HTTP http://my.ip/json
 * We also parse out the temperature value (celsius) and display it as html on the web root (/)
 * 
 * Connect TX/RX to the controller MCU's (Uno) SW serial pins
 * 
 * Kenny Dec 19, 2020
 */
#include <Arduino.h>
#include <FS.h>                   //this needs to be first, or it all crashes and burns...
#include "LittleFS.h" // LittleFS is declared

#if defined(ESP8266)
#include <ESP8266WiFi.h>          //https://github.com/esp8266/Arduino
#else
#include <WiFi.h>
#endif

#include <ESPAsyncWebServer.h>
#include <ESPAsyncWiFiManager.h>         //https://github.com/tzapu/WiFiManager
#include <ESP8266mDNS.h>
#include <ArduinoJson.h>
#include <BlynkSimpleEsp8266.h>
#include <ArduinoOTA.h>
#include <setup.h>
#include <main.h>

// store long global string in flash (put the pointers to PROGMEM)
const char FIRMWARE_VERSION_LONG[] PROGMEM = "PumpController (MCU ESP8266-WiFi) v" FIRMWARE_VERSION " build " __DATE__ " " __TIME__ " from file " __FILE__ " using GCC v" __VERSION__;

const char* _def_hostname = HOSTNAME;
const char* _def_port = PORT;



//flag to use from web firmware update to reboot the ESP
bool shouldReboot = false;
//WifiManger callback flag for saving data
bool shouldSaveConfig = false;

//char param1[6]; // testing wifimanager config

int blynk_button_V2 = 0;

//const char auth[] = BLYNK_TOKEN;
char json_output[200];
char data_string[200];

char celsius[5];
char pressure_bar[5];
StaticJsonDocument<200> data_json;
uint32_t previousMillis = 0; 
uint32_t previousMillis_200 = 0; 
uint16_t reconnects_wifi = 0;

DNSServer dns;
AsyncWebServer server(80);
AsyncWebSocket ws("/ws"); // access at ws://[esp ip]/ws
AsyncEventSource events("/events"); // event source (Server-Sent events)

// Every time we connect to the cloud...
BLYNK_CONNECTED() {
  // Request the latest state from the server
  Blynk.syncVirtual(V2);
}

// When App button is pushed - switch the state
BLYNK_WRITE(V2) {
  blynk_button_V2 = param.asInt();
  digitalWrite(PIN_LED_1, blynk_button_V2);
}


void setup(void) {
  pinMode(PIN_LED_1, OUTPUT);
  digitalWrite(PIN_LED_1, 0);
  pinMode(PIN_SW_RST, INPUT); // reset button

  strlcpy(celsius, "-0.0", sizeof(celsius));
  strlcpy(pressure_bar, "0.00", sizeof(pressure_bar));

  Serial.begin(115200);

  Serial.println("");
  Serial.println("initializing...");
  Serial.println(FPSTR(FIRMWARE_VERSION_LONG));
  Serial.println("Made by Ken-Roger Andersen, 2020");
  Serial.println("");
  Serial.println(F("To reset, press button for 5+ secs while powering on"));
  Serial.println("");
  delay(1000);

  
  Serial.print(F("Starting FS (LittleFS)..."));
  Setup::FileSystem();

  Serial.print(F("Loading configuration from /config.json..."));
  Setup::GetConfig();

  Serial.println(F("Starting WiFi..."));

  // TODO: read config.json (see example from ESPAsyncWiFiManager)

  //WiFiManager
  // The extra parameters to be configured (can be either global or just in the setup)
  // After connecting, parameter.getValue() will get you the configured value
  // id/name placeholder/prompt default length
  AsyncWiFiManagerParameter custom_hostname("hostname", "Hostname", config.hostname, 64);
  AsyncWiFiManagerParameter custom_port("port", "HTTP port", config.port, 6);

  //Local intialization. Once setup() done, there is no need to keep it around
  AsyncWiFiManager wifiManager(&server,&dns);

  Serial.printf("SSID: %s, key: %s\n", WiFi.SSID().c_str(), WiFi.psk().c_str());

  //reset settings if button pressed
  if(digitalRead(PIN_SW_RST) == LOW) {
    Serial.println(F("reset button pressed, keep pressed for 5 sec to reset all settings!"));
    delay(5000);
    if(digitalRead(PIN_SW_RST) == LOW) {
      Serial.println(F("reset button still pressed, all settings reset to default!"));
      delay(1000);
      wifiManager.resetSettings();

    } else {
      Serial.println(F("reset aborted! resuming startup..."));
    }
    
  }

  //set config save notify callback
  wifiManager.setSaveConfigCallback(saveConfigCallback);
  //set static ip
  //wifiManager.setSTAStaticIPConfig(IPAddress(192,168,30,254), IPAddress(192,168,30,1), IPAddress(255,255,255,0));

  // our custom parameters
  wifiManager.addParameter(&custom_hostname);
  wifiManager.addParameter(&custom_port);

  wifiManager.setBreakAfterConfig(true); // exit after config

  //fetches ssid and pass from eeprom and tries to connect
  //if it does not connect it starts an access point with the specified name
  //and goes into a blocking loop awaiting configuration
  if (!wifiManager.autoConnect("KRATECH-AP", "password")) {
    Serial.println(F("failed to connect, we should reset as see if it connects"));
    delay(3000);
    ESP.reset();
    delay(5000);
  }
 
  Serial.println("connected!");
  Serial.print("IP: ");
  Serial.println(WiFi.localIP());

  //save the custom parameters to FS
  if (shouldSaveConfig) {
    Serial.println(F("Saving config..."));
    if(Setup::SaveConfig()) {
      Serial.println("OK");
      //Serial.println(F("Rebooting..."));
      //ESP.restart();
      //while(1){};

      //read updated parameters
      strcpy(config.hostname, custom_hostname.getValue());
      strcpy(config.port, custom_port.getValue());
    } 
  }

  Serial.print(F("Starting Blynk..."));
  if(ConnectBlynk()) {
    Serial.println(F("OK - Connected to Blynk server"));
  } else {
    Serial.println(F("FAILED to connect to Blynk server!"));
  }

  Serial.print(F("Starting MDNS..."));
  if (MDNS.begin(config.hostname)) {
    Serial.println(F("OK"));
  } else {
    Serial.println(F("FAILED"));
  }

  // ************** ASync server (new)
  Serial.print(F("Starting HTTP server..."));

  if(Setup::WebServer()) {
    Serial.println(F("OK"));
    MDNS.addService("http", "tcp", 80);
    Serial.printf("HTTP server ready: http://%s.local:%s (MDNS/Bonjour)\n", config.hostname, config.port);
  } else {
    Serial.println(F("FAILED"));
  }
  Serial.println(F("OK"));
  

  Serial.println(F("Setup completed!"));
}

bool ConnectBlynk() {
  Serial.print(F("Connecting to Blynk servers (timeout 10 sec), token="));
  Serial.println(STR(BLYNK_TOKEN));
  Blynk.config(STR(BLYNK_TOKEN));  // in place of Blynk.begin(auth, ssid, pass);
  Blynk.connect(500);  // timeout set to 10 seconds and then continue without Blynk
  while (Blynk.connect() == false) {
    // Wait until connected
  }
  if(Blynk.connected()) {
    return true;
  } else {
    return false;
  }

}

void ReconnectWiFi() {  

    reconnects_wifi++;
    Serial.print("Reconnecting to ");
    Serial.print(WiFi.SSID());
    WiFi.mode(WIFI_STA);  
    WiFi.begin(WiFi.SSID().c_str(), WiFi.psk().c_str());  
    while (WiFi.status() != WL_CONNECTED) {  
        delay(500);  
        Serial.print(".");
        digitalWrite(PIN_LED_1, !digitalRead(PIN_LED_1));
    }  
    Serial.println("Connected!");
} 

/**
 * Read chars from Serial until newline and put string in buffer
 * 
 */
int readline(int readch, char *buffer, int len) {
    static int pos = 0;
    int rpos;

    if (readch > 0) {
        switch (readch) {
            case '\r': // Ignore CR
                break;
            case '\n': // Return on new-line
                rpos = pos;
                pos = 0;  // Reset position index ready for next time
                return rpos;
            default:
                if (pos < len-1) {
                    buffer[pos++] = readch;
                    buffer[pos] = 0;
                }
        }
    }
    return 0;
}

String HTMLProcessor(const String& var) {
  Serial.println(var);
  if (var == "TEMPERATURE"){
    return String(celsius);
  }
  else if (var == "WATERPRESSURE"){
    return String(pressure_bar);
  }
  else if (var == "UPTIMESECS"){
    return String(millis() / 1000);
  }
  else if (var == "FIRMWARE"){
    return String(FIRMWARE_VERSION);
  }
  else if (var == "FIRMWARE_LONG"){
    return String(FIRMWARE_VERSION_LONG);
  }
  return String();
}

//WifiManager callback notifying us of the need to save config
void saveConfigCallback () {
  Serial.println("Should save config");
  shouldSaveConfig = true;
}

void loop(void) {
  unsigned long currentMillis = millis();
  int wifitries = 0;

  if(shouldReboot){
    Serial.println("Rebooting...");
    delay(100);
    ESP.restart();
  }

  ArduinoOTA.handle();
//  server.handleClient();
  MDNS.update();
  Blynk.run();

  while ((WiFi.status() != WL_CONNECTED))
  {
      ReconnectWiFi();
      wifitries++;
      delay(1000);

      if (wifitries == 5)
      {
          return;
      }
  }

  if (currentMillis - previousMillis_200 >= 200L) { // update Blynk every 200ms
    Blynk.virtualWrite(V2, digitalRead(PIN_LED_1));
    previousMillis_200 = currentMillis;
  }

  if (currentMillis - previousMillis >= 60000L) { // once a minute, check Blynk connection
    previousMillis = currentMillis;

    if(!Blynk.connected()) {
      Serial.println(F("Blynk disconnected, reconnecting..."));
      ConnectBlynk();
    }
  }

  // read line (JSON) from hw serial RX (patched to UNO sw serial TX), then store it in data var, and resend it on hw TX for debug    
  //
  if (readline(Serial.read(), data_string, 200) > 0) {
    digitalWrite(PIN_LED_1, 1);
    const char* json_input = data_string;  
    // Deserialize the JSON document (zero-copy method)
    DeserializationError error = deserializeJson(data_json, json_input);

    // Test if parsing succeeds.
    if (error) {
      Serial.print(F("deserializeJson() failed: "));
      Serial.println(error.f_str());
    } else {
      memcpy(json_output, data_string, sizeof(data_string[0])*200);
      Serial.print("JSON rcvd: ");
      Serial.println(json_output);    

      dtostrf(data_json["temp_c"][0].as<float>(), 3, 1, celsius);
      dtostrf(data_json["pressure_bar"][0].as<float>(), 3, 1, pressure_bar);
    }
    
    // Push new values to Blynk server
    Blynk.virtualWrite(V0, pressure_bar);
    Blynk.virtualWrite(V1, celsius);
    digitalWrite(PIN_LED_1, 0);
  }

}
